@echo off
chcp 65001 >nul
title No2ta - شبكة الفصل الاجتماعية والسرية
color 0B

echo =========================================================================
echo    ⚡🚀 جاري تشغيل منصة "نؤطة" (No2ta) - شبكة الفصل الاجتماعية 🚀⚡
echo =========================================================================
echo.
echo  [+] السيرفر يعمل على منفذ الشبكة المحلية: 5000
echo  [+] كلمة السر الرئيسية للمنصة: SdSdSdSd
echo  [+] كلمة سر لوحة تحكم الأدمن: SdSdSdSdAdmin
echo  [+] زر البشمهندسة مفعل عبر اختصار F2 أو الضغط مرتين على Esc
echo.
echo =========================================================================

cd /d "%~dp0"
timeout /t 2 /nobreak >nul
start http://localhost:5000

node server.js

pause
